#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
module.iam_github_oidc_provider.data.tls_certificate.this[0]: Reading...
module.iam_github_oidc_provider.data.tls_certificate.this[0]: Read complete after 0s [id=43add1749d6d9832e0a8fca0784941273380c63a]
module.karpenter.data.aws_partition.current: Reading...
module.company-example-eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/company-example/cluster]
module.iam_github_oidc_role.data.aws_partition.current: Reading...
module.ebs_csi_irsa.data.aws_region.current: Reading...
module.iam_github_oidc_provider.data.aws_partition.current: Reading...
module.company-example-eks.data.aws_caller_identity.current: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.karpenter.data.aws_region.current: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
module.karpenter.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.ebs_csi_irsa.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_github_oidc_provider.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_ami.eks_default: Reading...
module.iam_github_oidc_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.company-example-eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.ebs_csi_irsa.data.aws_caller_identity.current: Reading...
module.company-example-eks.data.aws_partition.current: Reading...
module.company-example-vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01a268e4d3d7b316c]
module.ebs_csi_irsa.data.aws_partition.current: Reading...
module.karpenter.data.aws_caller_identity.current: Reading...
module.iam_github_oidc_role.data.aws_caller_identity.current: Reading...
module.company-example-eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.ebs_csi_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.company-example-eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.iam_github_oidc_provider.aws_iam_openid_connect_provider.this[0]: Refreshing state... [id=arn:aws:iam::381491846999:oidc-provider/token.actions.githubusercontent.com]
module.company-example-eks.aws_iam_role.this[0]: Refreshing state... [id=company-example-cluster-20240526140818129700000003]
module.ebs_csi_irsa.data.aws_iam_policy_document.ebs_csi[0]: Reading...
module.ebs_csi_irsa.data.aws_iam_policy_document.ebs_csi[0]: Read complete after 0s [id=212299854]
module.ebs_csi_irsa.aws_iam_policy.ebs_csi[0]: Refreshing state... [id=arn:aws:iam::381491846999:policy/AmazonEKS_EBS_CSI_Policy-20240526140818137600000005]
module.company-example-eks.data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.company-example-eks.data.aws_iam_session_context.current: Reading...
module.company-example-eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::381491846999:user/jfotopoulos]
module.karpenter.data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.company-example-eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=company-example-cluster-20240526140818129700000003-20240526140819961000000007]
module.company-example-eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=company-example-cluster-20240526140818129700000003-20240526140820167800000008]
module.ebs_csi_irsa.data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.iam_github_oidc_role.data.aws_caller_identity.current: Read complete after 1s [id=381491846999]
module.iam_github_oidc_role.data.aws_iam_policy_document.this[0]: Reading...
module.iam_github_oidc_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3462691479]
module.iam_github_oidc_role.aws_iam_role.this[0]: Refreshing state... [id=company-example-eks-admin]
data.aws_ami.eks_default: Read complete after 1s [id=ami-00f34b6d2d1f002b0]
module.company-example-vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0eb27470455662799]
module.company-example-vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0bd55256e5252d20d]
module.company-example-vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ef79faeb5b8ccd97]
module.company-example-vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0dfaa05abe8c9d383]
module.company-example-eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0f324dca11191a7d5]
module.company-example-vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-073ea1d095c1d8db1]
module.company-example-vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0bbf03405f1bb9fe9]
module.company-example-vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07f22851d830f435d]
module.company-example-vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-04e794fd32c99af46]
module.company-example-eks.aws_security_group.node[0]: Refreshing state... [id=sg-0b835d20568501027]
module.company-example-vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0668fd3e61cf78d7f]
module.company-example-vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0745f50aae781c12e]
module.company-example-vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-05663c52d5d4c64fc]
module.company-example-vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-098ecf95df9c37eff]
module.company-example-vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-073ea1d095c1d8db11080289494]
module.company-example-vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00f2f53ec46e8b643]
module.company-example-vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f580824ef0149b15]
module.company-example-vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ce2cb797c2db4354]
module.company-example-vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b3804b29a8fcb725]
module.company-example-vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0031ba91382867896]
module.company-example-vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-04f6269caca9edfd6]
module.company-example-vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0224b072fb1e7fdac]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1206717726]
module.company-example-eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3700035560]
module.company-example-eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1380719475]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-806355700]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-485650806]
module.company-example-eks.aws_security_group_rule.node["egress_vpc_all"]: Refreshing state... [id=sgrule-4231728787]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2393860744]
module.company-example-eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1541692896]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-859637569]
module.company-example-eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2027269127]
module.company-example-eks.aws_security_group_rule.node["egress_everywhere_allICMP"]: Refreshing state... [id=sgrule-2891853179]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1420898623]
module.company-example-eks.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-1318118290]
module.company-example-eks.aws_security_group_rule.cluster["ingress_allow_vpc_to_kube_api"]: Refreshing state... [id=sgrule-3848115912]
module.company-example-eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3952633035]
module.company-example-vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0c080284c5b096c7c]
module.company-example-vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-014ed34499d20070f]
module.company-example-vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0e69db9cc36bf8cc9]
module.company-example-vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=company-example-vpc]
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Reading...
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.company-example-vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0c50f5fb4d75c4dcc]
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=karpenter-eks-node-group-20240526140826167600000009]
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.company-example-vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0668fd3e61cf78d7f1080289494]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=karpenter-eks-node-group-20240526140826167600000009-2024052614082698090000000b]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=karpenter-eks-node-group-20240526140826167600000009-2024052614082685450000000a]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=karpenter-eks-node-group-20240526140826167600000009-2024052614082701550000000c]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=karpenter-eks-node-group-20240526140826167600000009-2024052614082714020000000d]
module.company-example-eks.aws_eks_cluster.this[0]: Refreshing state... [id=company-example]
module.company-example-eks.aws_eks_access_entry.this["Admins"]: Refreshing state... [id=company-example:arn:aws:iam::381491846999:role/company-example-eks-admin]
module.company-example-eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-0a0a7731891ba57c5,Project]
module.company-example-eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0a0a7731891ba57c5,Environment]
module.company-example-eks.data.tls_certificate.this[0]: Reading...
module.company-example-eks.time_sleep.this[0]: Refreshing state... [id=2024-05-26T14:19:15Z]
module.company-example-eks.module.eks_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=1625193542130577152]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-0a1a0e78ea25f88d5]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_eks_node_group.this[0]: Refreshing state... [id=company-example:karpenter-20240526141917315300000014]
module.company-example-eks.data.tls_certificate.this[0]: Read complete after 0s [id=585e5ff420479566f6257ba376c39b1343ba13d5]
module.company-example-eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::381491846999:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/05364FAF23496F008C33A4C46AC3F23D]
module.ebs_csi_irsa.data.aws_iam_policy_document.this[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.ebs_csi_irsa.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1969163404]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=1643244019]
module.ebs_csi_irsa.aws_iam_role.this[0]: Refreshing state... [id=ebs-csi]
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-2024052614184615110000000f]
module.ebs_csi_irsa.aws_iam_role_policy_attachment.ebs_csi[0]: Refreshing state... [id=ebs-csi-20240526141846891900000010]
module.company-example-eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.company-example-eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.company-example-eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.company-example-eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.company-example-eks.aws_eks_access_policy_association.this["Admins_first"]: Refreshing state... [id=company-example#arn:aws:iam::381491846999:role/company-example-eks-admin#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.company-example-eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
module.company-example-eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.company-example-eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.company-example-eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.company-example-eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=company-example:aws-ebs-csi-driver]
module.company-example-eks.aws_eks_addon.before_compute["vpc-cni"]: Refreshing state... [id=company-example:vpc-cni]
module.company-example-eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=company-example:coredns]
module.company-example-eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=company-example:kube-proxy]
module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20240526152048453800000002]
module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20240526152048455200000005]
module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20240526152048453400000001]
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=Karpenter-company-example-20240526152048454300000003]
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/381491846999/Karpenter-company-example]
module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20240526152048455200000004]
module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=Karpenter-company-example-20240526152048454300000003-20240526152048878700000008]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=Karpenter-company-example-20240526152048454300000003-20240526152048852800000006]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=Karpenter-company-example-20240526152048454300000003-20240526152048853400000007]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=Karpenter-company-example-20240526152048454300000003-20240526152048900500000009]
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=2267436545]
module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/381491846999/Karpenter-company-example]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=4080064039]
module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20240526152048453400000001-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20240526152048455200000005-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20240526152048453800000002-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20240526152048455200000004-KarpenterInterruptionQueueTarget]
module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::381491846999:policy/KarpenterController-2024052615211521310000000a]
module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=company-example:arn:aws:iam::381491846999:role/Karpenter-company-example-20240526152048454300000003]
module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-2024052614184615110000000f-2024052615211553820000000b]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

OpenTofu will perform the following actions:

  # module.EKSAdmin.aws_iam_policy.policy[0] will be created
  + resource "aws_iam_policy" "policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "EKS Admin Policy"
      + id               = (known after apply)
      + name             = "EKSAdmin"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Owner"     = "company-example"
          + "Terraform" = "true"
        }
    }

  # module.EKSView.aws_iam_policy.policy[0] will be created
  + resource "aws_iam_policy" "policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "EKS View only Policy"
      + id               = (known after apply)
      + name             = "EKSView"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:ListEksAnywhereSubscriptions",
                          + "eks:DescribeFargateProfile",
                          + "eks:ListTagsForResource",
                          + "eks:DescribeInsight",
                          + "eks:ListAccessEntries",
                          + "eks:ListAddons",
                          + "eks:DescribeEksAnywhereSubscription",
                          + "eks:DescribeAddon",
                          + "eks:ListAssociatedAccessPolicies",
                          + "eks:DescribeNodegroup",
                          + "eks:ListUpdates",
                          + "eks:DescribeAddonVersions",
                          + "eks:ListIdentityProviderConfigs",
                          + "eks:ListNodegroups",
                          + "eks:DescribeAddonConfiguration",
                          + "eks:DescribeAccessEntry",
                          + "eks:DescribePodIdentityAssociation",
                          + "eks:ListInsights",
                          + "eks:ListPodIdentityAssociations",
                          + "eks:ListFargateProfiles",
                          + "eks:DescribeIdentityProviderConfig",
                          + "eks:DescribeUpdate",
                          + "eks:AccessKubernetesApi",
                          + "eks:DescribeCluster",
                          + "eks:ListClusters",
                          + "eks:ListAccessPolicies",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Owner"     = "company-example"
          + "Terraform" = "true"
        }
    }

  # module.company-example-eks.aws_eks_access_policy_association.this["Admins_admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "company-example"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::381491846999:role/company-example-eks-admin"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.company-example-eks.aws_eks_access_policy_association.this["Admins_first"] will be destroyed
  # (because key ["Admins_first"] is not in for_each map)
  - resource "aws_eks_access_policy_association" "this" {
      - associated_at = "2024-05-26 15:20:47.986 +0000 UTC" -> null
      - cluster_name  = "company-example" -> null
      - id            = "company-example#arn:aws:iam::381491846999:role/company-example-eks-admin#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> null
      - modified_at   = "2024-05-26 15:20:47.986 +0000 UTC" -> null
      - policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> null
      - principal_arn = "arn:aws:iam::381491846999:role/company-example-eks-admin" -> null

      - access_scope {
          - namespaces = [] -> null
          - type       = "cluster" -> null
        }
    }

  # module.iam_github_oidc_role.aws_iam_role_policy_attachment.this["EKSView"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "company-example-eks-admin"
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/artifacts/plan-output.txt

To perform exactly these actions, run the following command to apply:
    tofu apply "/tmp/artifacts/plan-output.txt"

```

</details>

*Pusher: @johnf-staybull, Action: `pull_request`, Working Directory: ``, Workflow: `OpenTofu Setup WorkFlow`*